Examinator/src/Documents/ЗапросНаОбучениеСУО/ЗапросНаОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросНаОбучениеСУО</name>
  <registerRecords>InformationRegister.ЗапросыНаОбучениеСУО</registerRecords>
  <attributes>
    <name>ОбъектЗапроса</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросРассмотрен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветНаЗапрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРассмотрения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ЗапросыНаОбучениеСУО/ЗапросыНаОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапросыНаОбучениеСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ЗапросРассмотрен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектЗапроса</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/ЗапросНаОбучениеСУО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	// {{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Движения.ЗапросыНаОбучениеСУО.Записывать = Истина;
	// регистр ЗапросыНаОбучениеСУО 
	Движение = Движения.ЗапросыНаОбучениеСУО.Добавить();
	Движение.Период = Дата;
	Движение.ОбъектЗапроса = ОбъектЗапроса;
	Движение.Пользователь = Пользователь;
	Движение.ЗапросРассмотрен = ЗапросРассмотрен;
	Движение.ДатаПодачи = ДатаПодачи;

	// }}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#КонецЕсли
